#Criando DataFrame a partir de Dicionários

In [1]:
# importar o pandas 
import pandas as pd

In [4]:
# criar dicionário
dados = {
    'nome': ['Carlos', 'Theo', 'Raquel', 'Fernanda'],
    'idade': [35,32,15,49],
    'cidade': ['Araraquara', 'Belém', 'Natal', 'Curitiba'],
    'comprou': [True, False, False, True]
}

In [5]:

# criar DataFrame
df = pd.DataFrame(dados)

In [7]:
df.head()

       nome  idade      cidade  comprou
0    Carlos     35  Araraquara     True
1      Theo     32       Belém    False
2    Raquel     15       Natal    False
3  Fernanda     49    Curitiba     True

In [8]:
# criar id do usuário
id_usuario = [8712, 5831, 4421, 9873]

In [9]:
# associar o id do usuario à lista
df.index = id_usuario

In [10]:
df

          nome  idade      cidade  comprou
8712    Carlos     35  Araraquara     True
5831      Theo     32       Belém    False
4421    Raquel     15       Natal    False
9873  Fernanda     49    Curitiba     True

# DataFrames a partir de Listas

In [12]:
# listas
dados = [['Carlos', 35,'Araraquara', 'True'],
        ['Theo', 32, 'Natal', 'False'],
        ['Raquel', 12, 'SJC', 'True'],
        ['Fernanda', 14, 'Brasília', 'True']]

# criar DataFrame
df = pd.DataFrame(dados, columns=['nome', 'idade', 'cidade', 'comprou'],
                  index=[124, 543, 999,214])

# visualizar DataFrame
df

         nome  idade      cidade comprou
124    Carlos     35  Araraquara    True
543      Theo     32       Natal   False
999    Raquel     12         SJC    True
214  Fernanda     14    Brasília    True

In [13]:
# selecionar pelo index
df.loc[124]

nome           Carlos
idade              35
cidade     Araraquara
comprou          True
Name: 124, dtype: object

# criar novas colunas

In [18]:
# criar coluna 'saldo' 
df['saldo'] = 0.0

# visualizar DataFrame
df

         nome  idade      cidade comprou  saldo
124    Carlos     35  Araraquara    True    0.0
543      Theo     32       Natal   False    0.0
999    Raquel     12         SJC    True    0.0
214  Fernanda     14    Brasília    True    0.0

In [17]:
df

         nome  idade      cidade comprou  saldo
124    Carlos     35  Araraquara    True    0.0
543      Theo     32       Natal   False    0.0
999    Raquel     12         SJC    True    0.0
214  Fernanda     14    Brasília    True    0.0

# Modificar _index_ e colunas

In [21]:
# alterar indice
df.index = ['a', 'b', 'a', 'd'] 

# visualizar DataFrame
df

       nome  idade      cidade comprou  saldo
a    Carlos     35  Araraquara    True    0.0
b      Theo     32       Natal   False    0.0
a    Raquel     12         SJC    True    0.0
d  Fernanda     14    Brasília    True    0.0

In [22]:
df.loc['a']

     nome  idade      cidade comprou  saldo
a  Carlos     35  Araraquara    True    0.0
a  Raquel     12         SJC    True    0.0

In [23]:
df.columns = ['Nome do Cliente', 'Idade', 'Naturalidade', 'Fez Compras', 'Saldo']

In [24]:
df

  Nome do Cliente  Idade Naturalidade Fez Compras  Saldo
a          Carlos     35   Araraquara        True    0.0
b            Theo     32        Natal       False    0.0
a          Raquel     12          SJC        True    0.0
d        Fernanda     14     Brasília        True    0.0

In [28]:
df.index=['a', 'b', 'c', 'd']

In [29]:
df

  Nome do Cliente  Idade Naturalidade Fez Compras  Saldo
a          Carlos     35   Araraquara        True    0.0
b            Theo     32        Natal       False    0.0
c          Raquel     12          SJC        True    0.0
d        Fernanda     14     Brasília        True    0.0

In [30]:
divida = 50.0

In [32]:
df['Divida']= 50.0

In [33]:
df

  Nome do Cliente  Idade Naturalidade Fez Compras  Saldo  Divida
a          Carlos     35   Araraquara        True    0.0    50.0
b            Theo     32        Natal       False    0.0    50.0
c          Raquel     12          SJC        True    0.0    50.0
d        Fernanda     14     Brasília        True    0.0    50.0

In [37]:
df.pop('Divida')

a    50.0
b    50.0
c    50.0
d    50.0
Name: Divida, dtype: float64

In [38]:
df

  Nome do Cliente  Idade Naturalidade Fez Compras  Saldo
a          Carlos     35   Araraquara        True    0.0
b            Theo     32        Natal       False    0.0
c          Raquel     12          SJC        True    0.0
d        Fernanda     14     Brasília        True    0.0